# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'colordiff'
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'pickle'
brew 'pcre2'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'nvm'

# Apps
cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'coscreen'
cask 'docker'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'iterm2'
cask 'phpstorm'
cask 'ray'
cask 'reactotron'
cask 'rectangle'
cask 'sequel-ace'
cask 'slack'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tower'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Speedtest', id: 1153157709
mas 'Medis', id: 1063631769
mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
mas 'Transporter', id: 1450874784
